#+Title: Exercise 3.23
A deque (“double-ended queue”) is a sequence in which items can be inserted and deleted at either the front or the rear. Operations on deques are the constructor make-deque, the predicate empty-deque?, selectors front-deque and rear-deque, and mutators front-insert-deque!, rear-insert-deque!, front-delete-deque!, rear-delete-deque!. Show how to represent deques using pairs, and give implementations of the operations. All operations should be accomplished in Θ(1) steps.


** x

#+BEGIN_SRC scheme :session deque-local-state :exports both
  (define x (make-deque))

  ((x 'rear-insert-deque!) 'a)
  ((x 'rear-insert-deque!) 'b)
  ((x 'rear-insert-deque!) 'c)
#+END_SRC

#+RESULTS:
| a | b | c |

#+BEGIN_SRC scheme :session deque-local-state :exports both
  ((x 'front-insert-deque!) 'z)
  ((x 'front-insert-deque!) 'y)
  ((x 'front-insert-deque!) 'x)
#+END_SRC

#+RESULTS:
| x | y | z | a | b | c |

#+BEGIN_SRC scheme :session deque-local-state :exports both
  (x 'front-delete-deque!)
#+END_SRC

#+RESULTS:
| y | z | a | b | c |

#+BEGIN_SRC scheme :session deque-local-state :exports both
  (x 'rear-delete-deque!)
#+END_SRC

#+RESULTS:
| y | z | a | b |

** y - closure tests
#+BEGIN_SRC scheme :session deque-local-state :exports both
  (define y (make-deque))

  ((y 'rear-insert-deque!) 'i)
  ((y 'rear-insert-deque!) 'j)
  ((y 'rear-insert-deque!) 'k)
#+END_SRC

#+RESULTS:
| i | j | k |

#+BEGIN_SRC scheme :session deque-local-state :exports both
  ((y 'front-insert-deque!) 'p)
  ((y 'front-insert-deque!) 'q)
  ((y 'front-insert-deque!) 'r)
#+END_SRC

#+RESULTS:
| r | q | p | i | j | k |

#+BEGIN_SRC scheme :session deque-local-state :exports both
  (y 'front-delete-deque!)
#+END_SRC

#+RESULTS:
| q | p | i | j | k |

#+BEGIN_SRC scheme :session deque-local-state :exports both
  (y 'rear-delete-deque!)
#+END_SRC

#+RESULTS:
| q | p | i | j |

*** Test state of x
#+BEGIN_SRC scheme :session deque-local-state :exports both
  (x 'print-deque)
#+END_SRC

#+RESULTS:
| y | z | a | b |

